import React from 'react'
import { useLocation } from "react-router-dom";
import Data from './Data';

function Factory() {
    const SpNews = 
    {
        title: "หมีปะทะราชัน!",
        des:"แฟนลูกหนังต้องไม่พลาด 2 กูรูลูกหนังดังร่วมวิเคราะห์แบบสดๆ ก่อน-กลาง-หลังศึกแห่งศักดิ์ศรี มาดริด ดาร์บี้ แอตเลติโก มาดริด ปะทะ เรอัล มาดริด ที่มีความหวังแห่งการลุ้นแชมป์เป็นเดิมพัน คืนอาทิตย์ 7 มี.ค. 64 ตั้งแต่เวลา 21.45 น. เป็นต้นไปทางแฟนเพจทางการ beIN Sports Thailand พร้อมลุ้นของรางวัลดีๆ เพียบ beIN Sports Thailand จัดเต็มกับศึกใหญ่แห่งเวที ลา ลีกา ในสุดสัปดาห์นี้ โดยจับ ตังกุย และ เจมส์ ลา ลีกา 2 คอลัมนิสต์ลูกหนังชื่อดังของ SIAMSPORT ไลฟ์สดวิเคราะห์กันแบบสดๆ ถึงสถานการณ์ลุ้นแชมป์อันเข้มข้นของลีกสูงสุดเมืองกระทิง ซึ่งทัพ ตราหมี ของ ดีเอโก้ ซิเมโอเน่ นำเป็นจ่าฝูงอยู่โดยมี 58 คะแนน ขณะที่ ราชันชุดขาว ภายใต้การนำของ ซีเนดีน ซีดาน ตามอยู่ 5 คะแนน และแข่งมากกว่า 1 นัด ",
    };
    const ItNews = 
    {
        title: "WhatsApp โทรออกผ่านคอมพิวเตอร์ได้แล้ว",
        des:"แม้ว่า WhatsApp ยังอยู่ในประเด็นร้อนแรงเกี่ยวกับการอัปเดตนโยบายความเป็นส่วนตัวรูปแบบใหม่ จนทำให้หลายคนแบน WhatsApp แล้วไปใช้แอปพลิเคชันคู่แข่งแทน แต่ทาง WhatsApp ก้ยังโน้มน้าวด้วยฟีเจอร์ใหม่ ๆ อย่างต่อเนื่อง เช่นการโทรออกด้วยเสียงและวิดีโอผ่านแอปพลิเคชันบนคอมพิวเตอร์ Desktop ทาง WhatsApp แถลงผ่าน Blog ของเว็บไซต์ว่า ตลอดปี 2020 (พ.ศ.2563) ที่ผ่านมา มีจำนวนผู้ใช้งานโทรออกหากันผ่าน WhatsApp เพิ่มขึ้นมาก โดยเฉพาะในวันที่ 31 ธันวาคมที่มีผู้โทรออกและ Video Call มากถึง 1.4 พันล้านครั้ง ทาง WhatsApp จึงทำการปรับเปลี่ยนวิธีการสนทนาใหม่ ๆ อย่างการโทรและ Video Call ผ่านแอปพลิเคชันบนคอมพิวเตอร์ ทำให้ผู้ใช้งานติดต่อทุกคนได้ทุกที่ทั่วโลก ไม่ว่าจะใช้เทคโนโลยีใดอยู่ก็ตาม แต่ WhatsApp เองไม่ได้ระบุว่าจำนวนผู้ใช้งานผ่านคอมพิวเตอร์มีจำนวนเท่าไหร่ แต่นี่เป็นการเพิ่มทางเลือกให้ผู้ใช้งานทั้งหมดจำนวนราว ๆ 2 พันล้านคน และการใช้งานส่วนนี้ยังไม่สามารถทำได้บนเบราว์เซอร์ และคาดว่าในอนาคตจะสามารถใช้งานการโทรและ Video Call แบบกลุ่มได้",
    };
    const location = useLocation();
    console.log("NEWS = ",location.state);
    return (
        <div>
            {
            location.state === "SP"? 
            <Data news={SpNews}/>    // Yes news == SP
            :                           
            <Data news={ItNews}/>    // No news == IT
            }

        </div>
    )
}

export default Factory
